HSDTaskName = "Maintenance";

HSDFeedRollerHeaderTitle = "Feed Roller and Separation Pad Maintenance";
HSDNotifyMeTitle = "Notify me when maintenance is due.";
HSDTotalPagesTitle = "Total pages fed:";
HSDPagesSinceReplacementTitle = "Pages fed since last replacement:";
HSDPreviouslyRecordedReplacementsTitle = "Previously recorded replacements:";
HSDReplacementRecommendedTitle = "Replacement recommended now:";
HSDReplaceButtonTitle = "Record Replacement…";

RecordReplacementWarnTitle = "Record Replacement?";
RecordReplacementWarnText = "This action resets the pages fed count, and increments the replacement count for the feed roller and separation pad.";

MaintenanceRecommendedWarnTitle = "Maintenance Recommended";
MaintenanceRecommendedWarnText = "The scanner's feed roller and separation pad are due to be replaced.";
